app/views/users/search.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
                      <% end %>
                      <%= book.favorites.count %>

SELECT "books".* FROM "books" WHERE (title LIKE '%オピ%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
---
                  <td>
                    コメント数：<%= book.book_comments.count %>