app/views/users/show.html.erb

                <td>
                  コメント数：<%= book.book_comments.count %>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]