app/controllers/search_controller.rb

  def search
    @users = User.search(params[:name])
---
SELECT "users".* FROM "users"