app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @book = Book.new
    @user = current_user
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @user = current_user
    @user_find = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "c1a16b272cd9ecfbccc331a7e5d2f0c19d58d19f755ffb95eeb2c81df601"], ["introduction", ""], ["updated_at", "2020-11-03 11:47:11.297757"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def follows
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def followers
    user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE (name LIKE '%ke%')
SELECT "books".* FROM "books" WHERE (title LIKE '%オピ%')
---
  def search
    @user_or_book = params[:option]
    @how_search = params[:choice]

    if @user_or_book == "1"
      @users = User.search(params[:search], @user_or_book, @how_search)
    else
      @books = Book.search(params[:search], @user_or_book, @how_search)